package zadanie4;
/*
(3) Создайте абстрактный (abstract) класс без методов. Произведите от него класс и добавьте метод.
Создайте статический (static) метод, получающий ссылку на базовый класс,
проведите нисходящее преобразование к производному типу и вызовите его метод. Продемонстрируйте,
что такой способ работает, в методе main().
Теперь поместите в определение метода из базового класса ключевое слово abstract,
и необходимость в нисходящем преобразовании исчезнет.
 */

public abstract class AbstractClassWithOutMethods {
}
